load-test.yml
config:
  target: "https://todomvc.com"
  engines:
    playwright:
      # Tell Artillery to launch browsers without a UI (required for load testing)
      headless: true
      trace: true
      defaultNavigationTimeout: 60000 # 60 seconds
      defaultActionTimeout: 30000     # 30 seconds
  processor: "./artillery-processor.js"
  phases:
    - name: "Warm up"
      duration: 60           # 1 minute
      arrivalRate: 1         # 1 user per second
      
    - name: "Ramp up"
      duration: 180          # 3 minutes
      arrivalRate: 1         # Start at 1 user per second...
      rampTo: 10             # ...and gradually increase to 20 users per second
      
    - name: "Spike (Black Friday)"
      duration: 30           # 30 seconds
      arrivalRate: 20       # 100 users per second immediately

scenarios:
  - name: "TodoMVC Benchmark User Journey"
    engine: "playwright"
    testFunction: "runBenchmark"